// Напишите программу, которая будет принимать на вход два числа и выводить, является ли второе число 
// кратным первому.
// Если второе число некратно первому, то программа выводит остаток от деления.
// Примеры
// 14, 5 => нет, 4
// 16, 8 => да
// 4, 3 => нет, 1
int a = 16;
int b = 8;
int c = a % b;
if (c == 0) {
    Console.WriteLine("да");
}
else    {
    Console.WriteLine($"нет, {c}");
}