// Напишите программу, которая выводит третью с конца цифру заданного числа или сообщает, что третьей цифры нет.
// 456 => 6
// 7812 => 1
// 91 => Третьей цифры нет

int num = 7812;
int result = 0;
if (num < 100)  {
    Console.WriteLine("Третьей цифры нет");
}
else    {
    while (num / 100 > 0)    {
        result = num % 10;
        // num = num / 10;
        num /= 10;
    }
    Console.WriteLine(result);
}