/* // Задача 1: Напишите программу, которая принимает на вход число и проверяет, 
// кратно ли оно одновременно 7 и 23.

int num = 160;
string flag = "нет";
if ((num % 7 == 0) && (num % 23 == 0)) {
    flag = "да";
}
Console.WriteLine(flag);

// Задача 2: Напишите программу, которая принимает на вход координаты точки (X и Y), 
// причём X ≠ 0 и Y ≠ 0 и выдаёт номер координатной четверти плоскости, в которой находится эта точка.

int X = -2;
int Y = -4;
int quarter = 4;
if (X > 0 && Y > 0) {
    quarter = 1;
}
else if (X < 0 && Y > 0) {
    quarter = 2;
}
else if (X < 0 && Y < 0) {
    quarter = 3;
}
Console.WriteLine(quarter);

// Задача 3: Напишите программу, которая принимает на вход целое число из отрезка [10, 99] и 
// показывает наибольшую цифру числа.

int number = 99;
if (number / 10 > number % 10)    {
    Console.WriteLine(number/ 10);
}
else    {
    Console.WriteLine(number % 10);
} */
// Задача 4: Напишите программу, которая на вход принимает натуральное число N, 
// а на выходе показывает его цифры через запятую.

int N = 94842;
while (N > 0)   {
    Console.Write($"{N % 10}, ");
    N = N / 10;
}
